### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # module.aws.data.aws_ami.ubuntu_noble_24_04 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ami" "ubuntu_noble_24_04" {
+       architecture          = (known after apply)
+       arn                   = (known after apply)
+       block_device_mappings = (known after apply)
+       boot_mode             = (known after apply)
+       creation_date         = (known after apply)
+       deprecation_time      = (known after apply)
+       description           = (known after apply)
+       ena_support           = (known after apply)
+       hypervisor            = (known after apply)
+       id                    = (known after apply)
+       image_id              = (known after apply)
+       image_location        = (known after apply)
+       image_owner_alias     = (known after apply)
+       image_type            = (known after apply)
+       imds_support          = (known after apply)
+       kernel_id             = (known after apply)
+       last_launched_time    = (known after apply)
+       most_recent           = true
+       name                  = (known after apply)
+       name_regex            = "^ubuntu/images/hvm-ssd-gp3/ubuntu-noble-24.04-amd64-server-.*"
+       owner_id              = (known after apply)
+       owners                = [
+           "amazon",
        ]
+       platform              = (known after apply)
+       platform_details      = (known after apply)
+       product_codes         = (known after apply)
+       public                = (known after apply)
+       ramdisk_id            = (known after apply)
+       root_device_name      = (known after apply)
+       root_device_type      = (known after apply)
+       root_snapshot_id      = (known after apply)
+       sriov_net_support     = (known after apply)
+       state                 = (known after apply)
+       state_reason          = (known after apply)
+       tags                  = (known after apply)
+       tpm_support           = (known after apply)
+       usage_operation       = (known after apply)
+       virtualization_type   = (known after apply)

+       filter {
+           name   = "owner-alias"
+           values = [
+               "amazon",
            ]
        }

+       timeouts {
+           read = (known after apply)
        }
    }

  # module.aws.data.template_file.user_data will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "user_data" {
+       id       = (known after apply)
+       rendered = (known after apply)
+       template = <<-EOT
            #!/bin/bash
            set -ex
            
            # Variables
            INSTALL_PKGS="wget unzip git python3 python3-pip pipx"
            ANSIBLE_DATA_DIR="/home/onp-provisioner/ansible"
            GIT_REPO_NAME="myhome"
            GITLAB_REPO_URL="https://gitlab.mrmasaya.com/SoaB1/$${GIT_REPO_NAME}.git"
            # REQUIREMENTS_PATH="$${ANSIBLE_DATA_DIR}/$${GIT_REPO_NAME}/provision/ansible/master-node"
            
            USERS=(
              "msyadmin"
              "onp-provisioner"
            )
            
            # Function to send notifications
            send_notification() {
                local message="$1"
                curl -X POST -H "Content-Type: application/json" -d "{\content\: \<@&1339068066893529118>\n$${message}\}" "${webhook_url}"
            }
            
            ## Main
            # Set hostname
            hostnamectl set-hostname "${server_name}"
            
            # Update system
            apt update && apt upgrade -y
            
            # Install necessary packages
            add-apt-repository ppa:git-core/ppa
            apt update && apt install -y "$${INSTALL_PKGS}"
            
            # Create new users
            for user in "$${USERS[@]}"; do
                if id "$${user}" >/dev/null 2>&1; then
                    echo "User $${user} already exists. Skipping creation."
                else
                    useradd -m -d "/home/$${user}" -s /bin/bash "$${user}"
                    su - "$${user}" -c "mkdir -p ~/.ssh && chmod 700 ~/.ssh"
                    su - "$${user}" -c "curl -sS https://github.com/SoaB1.keys >> ~/.ssh/authorized_keys"
                    su - "$${user}" -c "chmod 600 ~/.ssh/authorized_keys"
                    echo "$${user} ALL=(ALL) NOPASSWD:ALL" >> /etc/sudoers.d/"$${user}"
                    chmod 440 /etc/sudoers.d/"$${user}"
                    echo "User $${user} created."
                fi
            done
            
            # Install tailscale
            curl -fsSL https://tailscale.com/install.sh > /tmp/tailscale-install.sh
            chmod +x /tmp/tailscale-install.sh
            /tmp/tailscale-install.sh
            
            if ! which tailscale > /dev/null; then
                echo "Tailscale installation failed. Exiting."
                send_notification "Tailscale installation failed on the Ansible server."
                exit 1
            fi
            # Join Tailscale network
            if [ -z "${tailnet_key}" ]; then
                echo "tailnet_key is not set. Skipping Tailscale join."
                send_notification "Tailscale key is not set for the Ansible server. Please check the configuration."
                exit 2
            else
                echo "Joining Tailscale network with key: ${tailnet_key}"
                tailscale up --auth-key="${tailnet_key}"
                tailscale set --advertise-routes="${subnet_cidr}"
            fi
            
            # Install pipx
            su - onp-provisioner -c "python3 -m pipx ensurepath"
            
            # Install Ansible
            su - onp-provisioner -c "pipx install --include-deps ansible"
            
            # Download setup Playbook
            su - onp-provisioner -c "mkdir -p $${ANSIBLE_DATA_DIR}"
            ln -s "$${ANSIBLE_DATA_DIR}" /ansible
            
            su - onp-provisioner -c "cd $${ANSIBLE_DATA_DIR} && git clone $${GITLAB_REPO_URL} $${GIT_REPO_NAME}"
            
            # # Install Ansible collections
            # cd "$${ANSIBLE_DATA_DIR}/$${GIT_REPO_NAME}" || exit 4
            # git checkout main
            # git fetch && git pull
            
            # ansible-galaxy collection install -r "$${REQUIREMENTS_PATH}/requirements.yml"
            
            # # Run Ansible Playbook
            
            # set +e
            # export ANSIBLE_CONFIG=$${REQUIREMENTS_PATH}/ansible.cfg"
            # ansible-playbook -i "$${REQUIREMENTS_PATH}/inventory/hosts.yaml" "$${REQUIREMENTS_PATH}/site.yaml" > /tmp/ansible_setup.log 2>&1
            
            # set +e
            
            send_notification "Ansible server setup completed successfully. Please check the logs for details."
        EOT
+       vars     = {
+           "server_name" = "Ansibleサーバ#1"
+           "subnet_cidr" = "172.18.1.0/26"
+           "tailnet_key" = (sensitive)
+           "webhook_url" = (sensitive)
        }
    }

  # module.aws.aws_instance.ansible_server will be created
+   resource "aws_instance" "ansible_server" {
+       ami                                  = (known after apply)
+       arn                                  = (known after apply)
+       associate_public_ip_address          = (known after apply)
+       availability_zone                    = (known after apply)
+       cpu_core_count                       = (known after apply)
+       cpu_threads_per_core                 = (known after apply)
+       disable_api_stop                     = (known after apply)
+       disable_api_termination              = (known after apply)
+       ebs_optimized                        = (known after apply)
+       enable_primary_ipv6                  = (known after apply)
+       get_password_data                    = false
+       host_id                              = (known after apply)
+       host_resource_group_arn              = (known after apply)
+       iam_instance_profile                 = (known after apply)
+       id                                   = (known after apply)
+       instance_initiated_shutdown_behavior = (known after apply)
+       instance_lifecycle                   = (known after apply)
+       instance_state                       = (known after apply)
+       instance_type                        = "t3.small"
+       ipv6_address_count                   = (known after apply)
+       ipv6_addresses                       = (known after apply)
+       key_name                             = "ec2"
+       monitoring                           = false
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
+       placement_partition_number           = (known after apply)
+       primary_network_interface_id         = (known after apply)
+       private_dns                          = (known after apply)
+       private_ip                           = (known after apply)
+       public_dns                           = (known after apply)
+       public_ip                            = (known after apply)
+       secondary_private_ips                = (known after apply)
+       security_groups                      = (known after apply)
+       spot_instance_request_id             = (known after apply)
+       subnet_id                            = (known after apply)
+       tags                                 = {
+           "Name" = "Ansibleサーバ#1"
        }
+       tags_all                             = {
+           "Name" = "Ansibleサーバ#1"
        }
+       tenancy                              = (known after apply)
+       user_data                            = (known after apply)
+       user_data_base64                     = (known after apply)
+       user_data_replace_on_change          = true
+       vpc_security_group_ids               = (known after apply)

+       capacity_reservation_specification {
+           capacity_reservation_preference = (known after apply)

+           capacity_reservation_target {
+               capacity_reservation_id                 = (known after apply)
+               capacity_reservation_resource_group_arn = (known after apply)
            }
        }

+       cpu_options {
+           amd_sev_snp      = (known after apply)
+           core_count       = (known after apply)
+           threads_per_core = (known after apply)
        }

+       ebs_block_device {
+           delete_on_termination = (known after apply)
+           device_name           = (known after apply)
+           encrypted             = (known after apply)
+           iops                  = (known after apply)
+           kms_key_id            = (known after apply)
+           snapshot_id           = (known after apply)
+           tags                  = (known after apply)
+           tags_all              = (known after apply)
+           throughput            = (known after apply)
+           volume_id             = (known after apply)
+           volume_size           = (known after apply)
+           volume_type           = (known after apply)
        }

+       enclave_options {
+           enabled = (known after apply)
        }

+       ephemeral_block_device {
+           device_name  = (known after apply)
+           no_device    = (known after apply)
+           virtual_name = (known after apply)
        }

+       instance_market_options {
+           market_type = (known after apply)

+           spot_options {
+               instance_interruption_behavior = (known after apply)
+               max_price                      = (known after apply)
+               spot_instance_type             = (known after apply)
+               valid_until                    = (known after apply)
            }
        }

+       maintenance_options {
+           auto_recovery = "default"
        }

+       metadata_options {
+           http_endpoint               = (known after apply)
+           http_protocol_ipv6          = (known after apply)
+           http_put_response_hop_limit = (known after apply)
+           http_tokens                 = (known after apply)
+           instance_metadata_tags      = (known after apply)
        }

+       network_interface {
+           delete_on_termination = false
+           device_index          = 0
+           network_card_index    = 0
+           network_interface_id  = (known after apply)
        }

+       private_dns_name_options {
+           enable_resource_name_dns_a_record    = (known after apply)
+           enable_resource_name_dns_aaaa_record = (known after apply)
+           hostname_type                        = (known after apply)
        }

+       root_block_device {
+           delete_on_termination = true
+           device_name           = (known after apply)
+           encrypted             = false
+           iops                  = (known after apply)
+           kms_key_id            = (known after apply)
+           tags_all              = (known after apply)
+           throughput            = 125
+           volume_id             = (known after apply)
+           volume_size           = 30
+           volume_type           = "gp3"
        }
    }

  # module.aws.aws_internet_gateway.mnigw_01 will be created
+   resource "aws_internet_gateway" "mnigw_01" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       owner_id = (known after apply)
+       tags     = {
+           "Name" = "mnigw-01"
        }
+       tags_all = {
+           "Name" = "mnigw-01"
        }
+       vpc_id   = (known after apply)
    }

  # module.aws.aws_network_interface.ansible_server_nic01 will be created
+   resource "aws_network_interface" "ansible_server_nic01" {
+       arn                       = (known after apply)
+       enable_primary_ipv6       = (known after apply)
+       id                        = (known after apply)
+       interface_type            = (known after apply)
+       ipv4_prefix_count         = (known after apply)
+       ipv4_prefixes             = (known after apply)
+       ipv6_address_count        = (known after apply)
+       ipv6_address_list         = (known after apply)
+       ipv6_address_list_enabled = false
+       ipv6_addresses            = (known after apply)
+       ipv6_prefix_count         = (known after apply)
+       ipv6_prefixes             = (known after apply)
+       mac_address               = (known after apply)
+       outpost_arn               = (known after apply)
+       owner_id                  = (known after apply)
+       private_dns_name          = (known after apply)
+       private_ip                = (known after apply)
+       private_ip_list           = (known after apply)
+       private_ip_list_enabled   = false
+       private_ips               = [
+           "172.18.1.30",
        ]
+       private_ips_count         = (known after apply)
+       security_groups           = (known after apply)
+       source_dest_check         = true
+       subnet_id                 = (known after apply)
+       tags_all                  = (known after apply)

+       attachment {
+           attachment_id = (known after apply)
+           device_index  = (known after apply)
+           instance      = (known after apply)
        }
    }

  # module.aws.aws_route_table.mnrt_01 will be created
+   resource "aws_route_table" "mnrt_01" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = [
+           {
+               carrier_gateway_id         = ""
+               cidr_block                 = "0.0.0.0/0"
+               core_network_arn           = ""
+               destination_prefix_list_id = ""
+               egress_only_gateway_id     = ""
+               gateway_id                 = (known after apply)
+               ipv6_cidr_block            = ""
+               local_gateway_id           = ""
+               nat_gateway_id             = ""
+               network_interface_id       = ""
+               transit_gateway_id         = ""
+               vpc_endpoint_id            = ""
+               vpc_peering_connection_id  = ""
            },
        ]
+       tags             = {
+           "Name" = "mnrt-01"
        }
+       tags_all         = {
+           "Name" = "mnrt-01"
        }
+       vpc_id           = (known after apply)
    }

  # module.aws.aws_route_table_association.mnrta_01 will be created
+   resource "aws_route_table_association" "mnrta_01" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.aws.aws_security_group.mnsg_01 will be created
+   resource "aws_security_group" "mnsg_01" {
+       arn                    = (known after apply)
+       description            = "mnsg-01"
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = "Outbound - Allow 443/TCP traffic"
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 443
            },
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = "Outbound - Allow 80/TCP traffic"
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 80
            },
+           {
+               cidr_blocks      = [
+                   "172.18.1.0/26",
                ]
+               description      = "Outbound - Allow all traffic to subnet-001"
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = [
+                   "172.18.1.0/26",
                ]
+               description      = "Inbound - Allow all traffic from subnet-001"
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
            },
        ]
+       name                   = "mnsg-01"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags_all               = (known after apply)
+       vpc_id                 = (known after apply)
    }

  # module.aws.aws_subnet.subnet_001 will be created
+   resource "aws_subnet" "subnet_001" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = (known after apply)
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "172.18.1.0/26"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = true
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "subnet-001"
        }
+       tags_all                                       = {
+           "Name" = "subnet-001"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.aws.aws_vpc.mnvpc_01 will be created
+   resource "aws_vpc" "mnvpc_01" {
+       arn                                  = (known after apply)
+       cidr_block                           = "172.18.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_dns_hostnames                 = (known after apply)
+       enable_dns_support                   = true
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       tags                                 = {
+           "Name" = "mnvpc-01"
        }
+       tags_all                             = {
+           "Name" = "mnvpc-01"
        }
    }

  # module.tailscale.data.tailscale_device.ansible_server will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "tailscale_device" "ansible_server" {
+       addresses = (known after apply)
+       id        = (known after apply)
+       name      = "Ansibleサーバ#1"
+       node_id   = (known after apply)
+       tags      = (known after apply)
+       user      = (known after apply)
    }

  # module.tailscale.tailscale_device_key.ansible_server_key will be created
+   resource "tailscale_device_key" "ansible_server_key" {
+       device_id           = (known after apply)
+       id                  = (known after apply)
+       key_expiry_disabled = true
    }

  # module.tailscale.tailscale_tailnet_key.tailnet_key will be created
+   resource "tailscale_tailnet_key" "tailnet_key" {
+       created_at    = (known after apply)
+       description   = "Ansible Server Tailnet Key"
+       expires_at    = (known after apply)
+       expiry        = (known after apply)
+       id            = (known after apply)
+       invalid       = (known after apply)
+       key           = (sensitive value)
+       preauthorized = true
+       reusable      = true
+       user_id       = (known after apply)
    }

  # module.tailscale.time_sleep.wait_join_tailnet will be created
+   resource "time_sleep" "wait_join_tailnet" {
+       create_duration = "120s"
+       id              = (known after apply)
    }

Plan: 11 to add, 0 to change, 0 to destroy.
```
</details>